// Перш, ніж розв’язувати задачу, давай визначимося із новим терміном!
// Термін slug — це зрозумілий людині унікальний ідентифікатор, який використовується у веб розробці для створення читабельних URL-адрес.
//
// Наприклад, замість того, щоб користувач побачив в адресному рядку mysite.com/posts/1q8fh74tx, можна зробити slug із назви статті.
// У результаті адреса буде приємнішою для сприйняття: mysite.com/posts/arrays-for-beginners.
//
// Slug — це завжди рядок у нижньому регістрі, слова якого розділені тире.
// З цим розібралися? А тепер давай нарешті виконувати задачу!
//
// Напиши функцію slugify(title), яка приймає заголовок статті, параметр title і повертає slug, створений із цього рядка.
// 
// Значенням параметра title будуть рядки, слова яких розділені лише пробілами.
// Усі символи slug повинні бути в нижньому регістрі.
// Усі слова slug повинні бути розділені тире.
// Візьми код нижче і встав після оголошення своєї функції для перевірки коректності її роботи. У консоль будуть виведені результати її роботи.

function slugify(title) {
    title = title.trim().toLowerCase(); // видаляємо пробіли на початку та вкінці, приводимо до нижнього регістру
    let slug =""; // оголошуємо новий рядок
    // створюємо цикл де будимо перебирати символи рядка
    for (let i = 0; i < title.length; i++){
        // якщо символ є пробілом
        if (title[i] === " ") {
            slug += "-"; // записуємо до нового рядка символ "-"
        }
        else slug += title[i]; // у іншому випадку додаємо символ до нового рядка
    }
    return slug; // повертаємо результат
}

console.log(slugify("Arrays for beginners")); // "arrays-for-beginners"
console.log(slugify("English for developer")); // "english-for-developer"
console.log(slugify("Ten secrets of JavaScript")); // "ten-secrets-of-javascript"
console.log(slugify("How to become a JUNIOR developer in TWO WEEKS")); // "how-to-become-a-junior-developer-in-two-weeks"